In [84]:
import pandas as pd
df=pd.read_csv('data_jobs_cleaned.csv')

In [85]:
df_us_job_counts=pd.read_csv('1_data_jobs_location_counts.csv')

In [86]:
df['job_location'] = df['job_location'].str.split(',', expand=True)[0].str.strip()

In [87]:
states_list=df_us_job_counts['job_location'].tolist()
states_list

['New York', 'Atlanta', 'Chicago', 'Dallas', 'Austin']

In [88]:
df_us_job_counts=(df[(df['job_title_short'].str.contains('Analyst')) & (df['job_country']=='United States')]
.groupby('job_location')
.size()
.sort_values(ascending=False)
.head(5)
)
df_us_job_counts=df_us_job_counts.reset_index(name='count')
df_us_job_counts

  job_location  count
0     Anywhere   4850
1     New York   2715
2      Atlanta   2417
3      Chicago   1985
4       Dallas   1587

In [89]:
df_us_da=df[(df['job_location'].isin(states_list)) & (df['job_title_short'].str.contains('Analyst'))]
df_us_da['job_location'].value_counts()

job_location
New York    2717
Atlanta     2419
Chicago     1987
Dallas      1609
Austin      1598
Name: count, dtype: int64

In [90]:
df_us_da['job_title_short'].value_counts()

job_title_short
Data Analyst           7728
Senior Data Analyst    1525
Business Analyst       1077
Name: count, dtype: int64

In [91]:
import numpy as np

In [92]:
da_jobs_grouped=df_us_da.groupby(['job_title_short', 'job_location'])['salary_year_avg'].agg(['mean', 'min', 'max'])
da_jobs_grouped['mean']=np.ceil(da_jobs_grouped['mean'])

In [93]:
da_jobs_grouped['mean']=da_jobs_grouped['mean'].astype(int)
da_jobs_grouped['min']=da_jobs_grouped['min'].astype(int)
da_jobs_grouped['max']=da_jobs_grouped['max'].astype(int)
da_jobs_grouped

                                    mean    min     max
job_title_short     job_location
Business Analyst    Atlanta       113731  60000  151950
                    Austin        113774  57500  138500
                    Chicago       114129  55000  118000
                    Dallas        113530  50000  131085
                    New York      114081  80000  142500
Data Analyst        Atlanta       114086  35000  245000
                    Austin        114397  37500  375000
                    Chicago       113733  36000  225000
                    Dallas        113907  32500  185000
                    New York      113188  42500  240000
Senior Data Analyst Atlanta       115048  64000  200000
                    Austin        114620  90000  175000
                    Chicago       114952  82000  162500
                    Dallas        114844  71850  175000
                    New York      114934  60000  340000

In [94]:
da_jobs_grouped.to_csv('2_analyst_salaries.csv')